In [ ]:
import pandas as pd
import sys
import os

sys.path.append(os.path.abspath('../src'))
import utils as util

df = pd.read_csv('../data/databaseElisa.csv', sep=';', decimal=',', thousands='.', 
                 index_col=None)

df.tail()

,data,fazenda,almoco,janta,cafe,lanche,vlrAlmoco,vlrJanta,vlrCafe,vlrLanche,total
3065,11/05/2025,Silo,5,6,5,0,20.0,20.0,8.5,8.5,262.5
3066,12/05/2025,Santa Elisa,5,1,6,1,20.0,20.0,8.5,8.5,179.5
3067,12/05/2025,Silo,12,6,14,0,20.0,20.0,8.5,8.5,479.0
3068,13/05/2025,Santa Elisa,9,2,6,1,20.0,20.0,8.5,8.5,279.5
3069,13/05/2025,Silo,12,6,14,0,20.0,20.0,8.5,8.5,479.0

In [2]:
util.generate_metadata(df)

   nome_variavel     tipo  qt_nulos  percent_nulos  cardinalidade
0         almoco    int64         0            0.0            343
1          janta    int64         0            0.0            236
2           cafe    int64         0            0.0            317
3         lanche    int64         0            0.0             68
4      vlrAlmoco  float64         0            0.0              5
5       vlrJanta  float64         0            0.0              5
6        vlrCafe  float64         0            0.0              5
7      vlrLanche  float64         0            0.0              5
8          total  float64         0            0.0           2718
9           data   object         0            0.0           1535
10       fazenda   object         0            0.0              2

In [ ]:
# Descrição estatística das colunas numéricasdf
cols_to_describe = ['almoco', 'janta', 'cafe', 'lanche', 'vlrAlmoco', 'vlrJanta', 'vlrCafe', 'vlrLanche', 'total']

df[cols_to_describe].describe()

,almoco,janta,cafe,lanche,vlrAlmoco,vlrJanta,vlrCafe,vlrLanche,total
count,3070.000000,3070.000000,3070.000000,3070.000000,3070.000000,3070.000000,3070.000000,3070.000000,3070.000000
mean,92.784691,53.519218,90.430619,13.315309,16.422997,16.422997,7.406254,7.406254,2975.872769
std,76.046257,51.519234,67.105843,15.135026,2.733533,2.733533,0.878378,0.878378,2212.446115
min,0.000000,0.000000,0.000000,0.000000,13.500000,13.500000,6.000000,6.000000,0.000000
25%,36.000000,17.250000,41.000000,1.000000,14.200000,14.200000,6.800000,6.800000,1272.025000
50%,72.000000,34.000000,73.000000,7.000000,14.200000,14.200000,6.800000,6.800000,2423.850000
75%,123.000000,72.000000,117.000000,22.000000,19.000000,19.000000,8.500000,8.500000,3994.625000
max,403.000000,257.000000,355.000000,88.000000,20.000000,20.000000,8.500000,8.500000,11236.000000

In [4]:
util.lista_valores_unicos(df, 'fazenda')

    Coluna    Categoria  Cardinalidade Porcentagem
0  fazenda  Santa Elisa           1535      50.00%
1  fazenda         Silo           1535      50.00%